import {
    ArrowTopRightOnSquareIcon,
    CheckCircleIcon,
} from "@heroicons/react/20/solid";
import Link from "next/link";
import DownloadButton from "@/app/(pages)/info/components/DownloadButton";

export default function Info() {
    return (
        <div className="px-6 py-32 lg:px-8">
            <div className="mx-auto max-w-3xl text-base/7 text-charcoal">
                <p className="text-base/7 font-semibold text-accent">
                    Ваше здоровье превыше всего
                </p>
                <h1 className="mt-2 text-pretty text-4xl font-semibold tracking-tight text-primary sm:text-5xl">
                    Полезная Информация
                </h1>
                <p className="mt-6 text-xl/8">
                    Добро пожаловать на страницу, посвященную полезной и нужной
                    информации. Для удобства в ней представлены несколько
                    разделов.
                </p>
                <div className="mt-10 max-w-2xl leading-8">
                    <h2 className="mt-16 text-pretty text-3xl font-semibold tracking-tight">
                        Тревога и Депрессия
                    </h2>
                    <div className="mt-6">
                        <p className="mt-4 indent-8">
                            Если вы чувствуете себя подавленным, испытываете
                            постоянную усталость или потерю интереса к жизни,
                            важно обратить внимание на свое психическое
                            здоровье.
                        </p>
                        <p className="mt-4 indent-8">
                            Я предлагаю вам пройти несколько онлайн-тестов,
                            которые помогут вам оценить ваше состояние и понять,
                            нуждаетесь ли вы в дополнительной поддержке.
                        </p>
                        <ul role="list" className="mt-4 max-w-xl space-y-4">
                            <li className="flex flex-col gap-y-1">
                                <div className="flex gap-x-3">
                                    <CheckCircleIcon
                                        aria-hidden="true"
                                        className="mt-2 size-5 flex-none text-accent"
                                    />
                                    <span>
                                        Тест на тревогу и депрессию (шкала HADS)
                                    </span>
                                </div>
                                <Link
                                    href="https://psytests.org/depr/hads-run.html"
                                    target="_blank"
                                    className="ms-8 w-fit flex items-center px-4 py-2 rounded-xl text-neutral text-sm font-medium tracking-wide transition-colors duration-300 bg-primary hover:bg-accent hover:text-charcoal"
                                >
                                    Пройти тест
                                    <ArrowTopRightOnSquareIcon className="ms-2 size-4" />
                                </Link>
                            </li>
                            <li className="flex flex-col gap-y-1">
                                <div className="flex gap-x-3">
                                    <CheckCircleIcon
                                        aria-hidden="true"
                                        className="mt-1 size-5 flex-none text-accent"
                                    />
                                    <span>
                                        Опросник по состоянию здоровья (шкала
                                        PHQ-9)
                                    </span>
                                </div>
                                <Link
                                    href="https://psytests.org/depr/phq9-run.html"
                                    target="_blank"
                                    className="ms-8 w-fit flex items-center text-nowrap px-4 py-2 rounded-xl text-neutral text-sm font-medium tracking-wide transition-colors duration-300 bg-primary hover:bg-accent hover:text-charcoal"
                                >
                                    Пройти опрос
                                    <ArrowTopRightOnSquareIcon className="ms-2 size-4" />
                                </Link>
                            </li>
                        </ul>
                        <p className="mt-4 indent-8">
                            Прохождение тестов на депрессию — это первый шаг к
                            пониманию своего состояния.
                        </p>
                        <p className="mt-4 indent-8">
                            Если вы получили высокие результаты или чувствуете,
                            что нуждаетесь в помощи, обязательно обращайтесь ко
                            мне. Я помогу Вам значительно улучшить качество
                            жизни.
                        </p>
                    </div>
                </div>
                <div className="mt-16 max-w-2xl leading-8">
                    <h2 className="text-pretty text-3xl font-semibold tracking-tight">
                        Вестибулярная Реабилитация
                    </h2>
                    <div className="mt-6">
                        <p className="mt-4 indent-8">
                            Вестибулярная гимнастика — это комплекс упражнений,
                            направленных на улучшение работы вестибулярного
                            аппарата, который отвечает за равновесие и
                            координацию движений. Она особенно полезна для
                            людей, страдающих от проблем с вестибулярной
                            системой, таких как головокружение, нарушения
                            равновесия или вестибулярные расстройства.
                        </p>
                        <p className="mt-4 indent-8">
                            Перед началом занятий обязательно
                            проконсультируйтесь с врачом или специалистом в
                            области реабилитации, особенно если у вас есть
                            хронические заболевания или проблемы с вестибулярной
                            системой. Регулярные тренировки помогут вам достичь
                            лучших результатов и улучшить качество жизни.
                        </p>
                        <p className="mt-4 mb-6 indent-8">
                            Готовы начать? Скачайте комплекс упражнений и
                            сделайте первый шаг к улучшению вашего здоровья и
                            самочувствия!
                        </p>
                        <DownloadButton />
                    </div>
                </div>
                <div className="mt-16 max-w-2xl leading-8">
                    <h2 className="text-pretty text-3xl font-semibold tracking-tight">
                        Головная Боль
                    </h2>
                    <div className="mt-6">
                        <p className="mt-4 indent-8">
                            Если вы хотите лучше понять свою головную боль и
                            научиться с ней справляться, вы на правильном пути!
                            Дневник по головной боли — это полезный инструмент,
                            который помогает людям лучше понимать и управлять
                            своими головными болями.
                        </p>
                        <p className="mt-4 indent-8">
                            Рекомендую использовать дневник головной боли:{" "}
                        </p>
                        <Link
                            href="https://t.me/Migrebot"
                            target="_blank"
                            className="ms-8 mt-2 w-fit flex items-center text-nowrap px-4 py-2 rounded-xl text-neutral text-sm font-medium tracking-wide transition-colors duration-300 bg-primary hover:bg-accent hover:text-charcoal"
                        >
                            Телеграм Migrebot
                            <svg
                                className="ms-2 size-5"
                                fill="currentColor"
                                xmlns="http://www.w3.org/2000/svg"
                                viewBox="0 0 50 50"
                            >
                                <path d="M25,2c12.703,0,23,10.297,23,23S37.703,48,25,48S2,37.703,2,25S12.297,2,25,2z M32.934,34.375	c0.423-1.298,2.405-14.234,2.65-16.783c0.074-0.772-0.17-1.285-0.648-1.514c-0.578-0.278-1.434-0.139-2.427,0.219	c-1.362,0.491-18.774,7.884-19.78,8.312c-0.954,0.405-1.856,0.847-1.856,1.487c0,0.45,0.267,0.703,1.003,0.966	c0.766,0.273,2.695,0.858,3.834,1.172c1.097,0.303,2.346,0.04,3.046-0.395c0.742-0.461,9.305-6.191,9.92-6.693	c0.614-0.502,1.104,0.141,0.602,0.644c-0.502,0.502-6.38,6.207-7.155,6.997c-0.941,0.959-0.273,1.953,0.358,2.351	c0.721,0.454,5.906,3.932,6.687,4.49c0.781,0.558,1.573,0.811,2.298,0.811C32.191,36.439,32.573,35.484,32.934,34.375z"></path>
                            </svg>
                        </Link>
                        <p className="mt-6 indent-8">
                            А если вы уже имеете поставленный диагноз «Мигрень»,
                            представляю вам{" "}
                            <span className="font-semibold">
                                пошаговую инструкцию по купированию головной
                                боли
                            </span>
                            . Эта инструкция станет вашим надежным помощником в
                            борьбе с головной болью и включает в себя
                            медикаментозные и немедикаментозные методы
                            облегчения боли, а также что не надо принимать во
                            время приступа.
                        </p>
                        <p className="mt-4 indent-8">
                            Для приобретения инструкции пишите на WhatsApp с
                            текстом «Хочу инструкцию».
                        </p>
                        <p className="mt-4 text-xl font-semibold text-primary">
                            Стоимость 1 000 руб
                        </p>
                        <Link
                            href="https://wa.me/79935042280"
                            target="_blank"
                            className="ms-8 mt-4 w-fit flex items-center text-nowrap px-4 py-2 rounded-xl text-neutral text-sm font-medium tracking-wide transition-colors duration-300 bg-primary hover:bg-accent hover:text-charcoal"
                        >
                            Пишите в Whatsapp
                            <svg
                                className="ms-2 size-5"
                                fill="currentColor"
                                xmlns="http://www.w3.org/2000/svg"
                                viewBox="0 0 50 50"
                            >
                                <path d="M 25 2 C 12.309534 2 2 12.309534 2 25 C 2 29.079097 3.1186875 32.88588 4.984375 36.208984 L 2.0371094 46.730469 A 1.0001 1.0001 0 0 0 3.2402344 47.970703 L 14.210938 45.251953 C 17.434629 46.972929 21.092591 48 25 48 C 37.690466 48 48 37.690466 48 25 C 48 12.309534 37.690466 2 25 2 z M 25 4 C 36.609534 4 46 13.390466 46 25 C 46 36.609534 36.609534 46 25 46 C 21.278025 46 17.792121 45.029635 14.761719 43.333984 A 1.0001 1.0001 0 0 0 14.033203 43.236328 L 4.4257812 45.617188 L 7.0019531 36.425781 A 1.0001 1.0001 0 0 0 6.9023438 35.646484 C 5.0606869 32.523592 4 28.890107 4 25 C 4 13.390466 13.390466 4 25 4 z M 16.642578 13 C 16.001539 13 15.086045 13.23849 14.333984 14.048828 C 13.882268 14.535548 12 16.369511 12 19.59375 C 12 22.955271 14.331391 25.855848 14.613281 26.228516 L 14.615234 26.228516 L 14.615234 26.230469 C 14.588494 26.195329 14.973031 26.752191 15.486328 27.419922 C 15.999626 28.087653 16.717405 28.96464 17.619141 29.914062 C 19.422612 31.812909 21.958282 34.007419 25.105469 35.349609 C 26.554789 35.966779 27.698179 36.339417 28.564453 36.611328 C 30.169845 37.115426 31.632073 37.038799 32.730469 36.876953 C 33.55263 36.755876 34.456878 36.361114 35.351562 35.794922 C 36.246248 35.22873 37.12309 34.524722 37.509766 33.455078 C 37.786772 32.688244 37.927591 31.979598 37.978516 31.396484 C 38.003976 31.104927 38.007211 30.847602 37.988281 30.609375 C 37.969311 30.371148 37.989581 30.188664 37.767578 29.824219 C 37.302009 29.059804 36.774753 29.039853 36.224609 28.767578 C 35.918939 28.616297 35.048661 28.191329 34.175781 27.775391 C 33.303883 27.35992 32.54892 26.991953 32.083984 26.826172 C 31.790239 26.720488 31.431556 26.568352 30.914062 26.626953 C 30.396569 26.685553 29.88546 27.058933 29.587891 27.5 C 29.305837 27.918069 28.170387 29.258349 27.824219 29.652344 C 27.819619 29.649544 27.849659 29.663383 27.712891 29.595703 C 27.284761 29.383815 26.761157 29.203652 25.986328 28.794922 C 25.2115 28.386192 24.242255 27.782635 23.181641 26.847656 L 23.181641 26.845703 C 21.603029 25.455949 20.497272 23.711106 20.148438 23.125 C 20.171937 23.09704 20.145643 23.130901 20.195312 23.082031 L 20.197266 23.080078 C 20.553781 22.728924 20.869739 22.309521 21.136719 22.001953 C 21.515257 21.565866 21.68231 21.181437 21.863281 20.822266 C 22.223954 20.10644 22.02313 19.318742 21.814453 18.904297 L 21.814453 18.902344 C 21.828863 18.931014 21.701572 18.650157 21.564453 18.326172 C 21.426943 18.001263 21.251663 17.580039 21.064453 17.130859 C 20.690033 16.232501 20.272027 15.224912 20.023438 14.634766 L 20.023438 14.632812 C 19.730591 13.937684 19.334395 13.436908 18.816406 13.195312 C 18.298417 12.953717 17.840778 13.022402 17.822266 13.021484 L 17.820312 13.021484 C 17.450668 13.004432 17.045038 13 16.642578 13 z M 16.642578 15 C 17.028118 15 17.408214 15.004701 17.726562 15.019531 C 18.054056 15.035851 18.033687 15.037192 17.970703 15.007812 C 17.906713 14.977972 17.993533 14.968282 18.179688 15.410156 C 18.423098 15.98801 18.84317 16.999249 19.21875 17.900391 C 19.40654 18.350961 19.582292 18.773816 19.722656 19.105469 C 19.863021 19.437122 19.939077 19.622295 20.027344 19.798828 L 20.027344 19.800781 L 20.029297 19.802734 C 20.115837 19.973483 20.108185 19.864164 20.078125 19.923828 C 19.867096 20.342656 19.838461 20.445493 19.625 20.691406 C 19.29998 21.065838 18.968453 21.483404 18.792969 21.65625 C 18.639439 21.80707 18.36242 22.042032 18.189453 22.501953 C 18.016221 22.962578 18.097073 23.59457 18.375 24.066406 C 18.745032 24.6946 19.964406 26.679307 21.859375 28.347656 C 23.05276 29.399678 24.164563 30.095933 25.052734 30.564453 C 25.940906 31.032973 26.664301 31.306607 26.826172 31.386719 C 27.210549 31.576953 27.630655 31.72467 28.119141 31.666016 C 28.607627 31.607366 29.02878 31.310979 29.296875 31.007812 L 29.298828 31.005859 C 29.655629 30.601347 30.715848 29.390728 31.224609 28.644531 C 31.246169 28.652131 31.239109 28.646231 31.408203 28.707031 L 31.408203 28.708984 L 31.410156 28.708984 C 31.487356 28.736474 32.454286 29.169267 33.316406 29.580078 C 34.178526 29.990889 35.053561 30.417875 35.337891 30.558594 C 35.748225 30.761674 35.942113 30.893881 35.992188 30.894531 C 35.995572 30.982516 35.998992 31.07786 35.986328 31.222656 C 35.951258 31.624292 35.8439 32.180225 35.628906 32.775391 C 35.523582 33.066746 34.975018 33.667661 34.283203 34.105469 C 33.591388 34.543277 32.749338 34.852514 32.4375 34.898438 C 31.499896 35.036591 30.386672 35.087027 29.164062 34.703125 C 28.316336 34.437036 27.259305 34.092596 25.890625 33.509766 C 23.114812 32.325956 20.755591 30.311513 19.070312 28.537109 C 18.227674 27.649908 17.552562 26.824019 17.072266 26.199219 C 16.592866 25.575584 16.383528 25.251054 16.208984 25.021484 L 16.207031 25.019531 C 15.897202 24.609805 14 21.970851 14 19.59375 C 14 17.077989 15.168497 16.091436 15.800781 15.410156 C 16.132721 15.052495 16.495617 15 16.642578 15 z"></path>
                            </svg>
                        </Link>
                    </div>
                </div>
            </div>
        </div>
    );
}
